Revit 2027 API
BuiltInFailures.StairRampFailures.RailingCurvesNotSplitRamp Property
 The slope of this railing will not parallel the ramp at landings. To get a parallel railing, split the railing sketch at the ends of landings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailingCurvesNotSplitRamp { get; }
Public Shared ReadOnly Property RailingCurvesNotSplitRamp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailingCurvesNotSplitRamp {
	FailureDefinitionId^ get ();
}
static member RailingCurvesNotSplitRamp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace